#include <iostream>
#include <cmath> 
using namespace std;
int main() {
// ЧАСТИНА 1: ЗАЛИШОК ПРИ ДІЛЕННІ НА 7
int X;
cout << "1. Залишок при діленні на 7\n";
cout << "Введіть ціле число X: ";
cin >> X;

int zalishok = X % 7; 
cout << "Залишок при діленні " << X << " на 7 дорівнює: " << zalishok << endl;

// ЧАСТИНА 2: ДІЛЕННЯ ДВОХ ЧИСЕЛ
int A, B;
cout << "Введіть два цілих числа (A та B): ";
cin >> A >> B;

 // Обчислюємо залишок A на B
int zalishok_AB = A % B;
// Перевірка, чи ділиться без залишку (умова: залишок дорівнює 0)
 if (zalishok_AB == 0) {
        cout << A << " ділиться на " << B << " без залишку.\n";
    } else {
        cout << A << " ділиться на " << B << " із залишком: " << zalishok_AB << ".\n";
    }
// ЧАСТИНА 3: ПЕРЕВІРКА НА ПАРНІСТЬ
cout << "\n3. Перевірка на парність\n";
// Перевірка парності A: якщо A % 2 == 0, то парне.
cout << "Число A (" << A << ") - ";
    if (A % 2 == 0) {
        cout << "парне.\n";
    } else {
        cout << "непарне.\n";
    }

// Перевірка парності B:
cout << "Число B (" << B << ") - ";
if (B % 2 == 0) {
        cout << "парне.\n";
    } else {
        cout << "непарне.\n";
    }

    return 0;
}